In [1]:
import pandas as pd
df = pd.read_csv("employee.csv")
df.head(2)

   ID FirstName  LastName Gender   Salary  bonus Location
0   1       Ben   Hoskins   Male  70000.0    500    Delhi
1   2      Mark  Hastings   Male  60000.0   1000   Mumbai

In [2]:
# df['Salary'].apply(lambda x: x+1,axis=1)
#here shows error because we are using series here and providing axis

##### df.apply(function, axis=0)       
##### axis=0 (default)
##### row or column     “Work one row or one column at a time”

In [3]:
df.fillna(0).apply(lambda x: x['Salary']+ x['bonus'],axis=1)
# Runs a function on each row or each column.

0    70500.0
1    61000.0
2    50000.0
3    79000.0
4    46000.0
5    31000.0
6    37000.0
7    90000.0
8    55000.0
9     1000.0
dtype: float64

In [4]:
list1=[]
for i in df['bonus']:
    list1.append(i)
print(list1)

[500, 1000, 5000, 9000, 1000, 1000, 2000, 10000, 5000, 1000]

In [5]:
for i,x in zip(df['bonus'],df['Salary']):
    print(i+x)

70500.0
61000.0
50000.0
79000.0
46000.0
31000.0
37000.0
90000.0
55000.0
nan

##### df.map(function) works on series

In [6]:
df['Salary'].map(lambda x: x+1000)

0    71000.0
1    61000.0
2    46000.0
3    71000.0
4    46000.0
5    31000.0
6    36000.0
7    81000.0
8    51000.0
9        NaN
Name: Salary, dtype: float64

##### df.applymap()

In [7]:
df[['Salary','bonus']].applymap(lambda x: x*2)

C:\Users\aksha\AppData\Local\Temp\ipykernel_22420\1068024464.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df[['Salary','bonus']].applymap(lambda x: x*2)

     Salary  bonus
0  140000.0   1000
1  120000.0   2000
2   90000.0  10000
3  140000.0  18000
4   90000.0   2000
5   60000.0   2000
6   70000.0   4000
7  160000.0  20000
8  100000.0  10000
9       NaN   2000